/*
 * Оголошення
 * Оголосити дві змінні без ініціалізації – одну міняти не можна буде, іншу можна
 * Присвоїти їм будь-які значення
 */

// console.log('variable1 -', variable1);
// console.log('variable2 -', variable2);

// /////////////////////////////////////////////////////////

/*
 * Зміна
 * Спробувати змінити значення оголошених вище змінних
 */

// console.log('variable1 -', variable1);
// console.log('variable2 -', variable2);

// /////////////////////////////////////////////////////////

/*
 * Повторне оголошення
 * Оголосити дві змінні з однаковим ім'ям (let/const), але різними значеннями
 */

// console.log('variable1 -', variable1);
// console.log('variable2 -', variable2);
