// Приклад 1 - Цикл for
// Напиши цикл for який виводить у консоль браузера числа за зростанням від min до max, але тільки якщо число кратне 5.

// const max = 100;
// const min = 20;

//////////////////////////////////////////////////////////

// Приклад 2 - Цикл for
//Напишіть цикл for який виводить у консоль браузера числа за спаданням від max до min.

// const max = 100;
// const min = 90;

//////////////////////////////////////////////////////////

// Приклад 3 - Цикл for
// За допомогою циклу for виведіть парні числа від 1 до 10.

// let min = 1;
// const max = 10;

// Рішення 1:

// Рішення 2: з continue

////////////////////////////////////////////////////

/*
 * Приклад 4 - Запитати у користувача число 3 рази (`Enter a number #${currentCount} of ${totalCount}`)
 * Порахувати суму цих чисел і вивести на екран (`Total sum is ${sum}`)
 * Якщо користувач натиснув Cancel, необхідно зупинити цикл і вивести на екран повідомлення ('You finished the game').
 * Якщо ввів не число, то вивести на екран повідомлення (`${userAnswer} is not a number! Try again`) і перервати цю ітерацію
 */

// WHILE

// 1) лічильник, кількість ітерацій, сума
// 2) умова виконання циклу
// 3) тіло циклу зі зверненням до користувача
// 4) перевірка на Cancel
// 5) перевірка на не число
// 6) лічильник та сума повинні змінюватися

// const totalCount = 3;
// let currentCount = 1;
// let sum = 0;

//////////////////////////////////////////////////////////

/*
 * Приклад 5 - Цикл do...while
 * Напишіть цикл, який пропонує ввести число більше 100 через prompt ('Enter a number more than 100').
 * Якщо користувач ввів інше число - попросити ввести ще раз, і так далі ('You missed! Try again').
 * Цикл повинен запитувати число поки:
 * - користувач не введе число, більше 100 ('Well done! You entered [number]!'),
 * - або не натисне кнопку Cancel в prompt ('You finished the game!').
 * Передбачається, що користувач вводить лише цифри.
 * Обробляти нечислові рядки не потрібно.
 */

// DO WHILE

// let userNum = 0;
