// const condition = true;

// if (condition) {
//   console.log('Evrika!');
// }

/////////////////////////////////////////////

// const condition = null;

// if (condition) {
//   console.log('Evrika!');
// } else {
//   console.log('Nope');
// }

///////////////////////////////////////////////////

// Використовуючи конструкцію if..else, напишіть код, який запитуватиме: "What is the official name of JavaScript?". Якщо користувач вводить "ECMAScript", то показати: "Yep!", інакше – відобразити: "Don't you know? ECMAScript!"

///////////////////////////////////////////////

// Напиши скрипт для відображення годин та хвилин у консолі браузера у вигляді рядка формату "14 год. 26 хв.". Якщо значення змінної minutes дорівнює 0, то виводь рядок "14 год.", без хвилин.

// const hours = 14;
// const minutes = 10;
// let timestring;

// console.log(timestring);

//////////////////////////////////////////////////

// Напиши скрипт, який виводить у консоль рядок "Це позитивне число", якщо в prompt користувач ввів число більше за нуль.
// Якщо введено нуль, виводь у консоль рядок "Це нуль".
// Якщо передали від'ємне число, у консолі має бути рядок "Це від'ємне число".

// const userInput = prompt('Введіть число');

//////////////////////////////////////////////////

// Напиши скрипт, який порівнює числа змінних a і b.
// Якщо обидва значення більше 100, виведи в консоль максимальне з них.
// Інакше у консолі має бути сума значення b та числа 512.

// const a = 120;
// const b = 180;

/////////////////////////////////////////////////////

// Напиши скрипт який перевіряє чи закінчується значення змінної link символом /.
// Якщо ні, додай до кінця значення link цей символ.
// Використовуй конструкцію if...else.

// let link = 'https://my-site.com/about';

// console.log(link);

///////////////////////////////////////////////////

// Напиши скрипт який перевіряє чи закінчується значення змінної link символом /.
// Якщо ні, додай у кінець значення link цей символ, але тільки в тому випадку, якщо в link є підрядок "my-site".
// Використовуй конструкцію if...else.

// let link = 'https://somesite.com/about';

// console.log(link);

///////////////////////////////////////////////////

// Напиши скрипт який виводитиме в консоль браузера рядок залежно від значення змінної hours.

// Якщо значення змінної hours:
// - менше 17, виводь рядок "Pending"
// - більше або дорівнює 17 і менше або дорівнює 24, виводь рядок "Expires"
// більше 24, виводь рядок "Overdue"

// const hours = 10;
